Ракович_В_Ю_70189466/src/Catalogs/ПоказателиЗдоровья/ПоказателиЗдоровья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиЗдоровья</name>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанных</name>
    <type>
      <types>EnumRef.ТипДанныхПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КритическийМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КритическийМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьИзмерения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Ракович_В_Ю_70189466/src/Catalogs/ПоказателиЗдоровья/ObjectModule.bsl
// Проверка значения на соответствие норме
Функция ПроверитьЗначение(Значение, Возраст = Неопределено) Экспорт
    
    Если Значение < КритическийМин Тогда
        Возврат "Критически низкое";
    ИначеЕсли Значение < НормаМин Тогда
        Возврат "Ниже нормы";
    ИначеЕсли Значение > НормаМакс И Значение <= КритическийМакс Тогда
        Возврат "Выше нормы";
    ИначеЕсли Значение > КритическийМакс Тогда
        Возврат "Критически высокое";
    Иначе
        Возврат "В норме";
    КонецЕсли;
    
КонецФункции

// Расчет отклонения от нормы в процентах
Функция РассчитатьОтклонение(Значение) Экспорт
    
    Если Значение < НормаМин Тогда
        Возврат (Значение - НормаМин) / НормаМин * 100;
    ИначеЕсли Значение > НормаМакс Тогда
        Возврат (Значение - НормаМакс) / НормаМакс * 100;
    Иначе
        Возврат 0;
    КонецЕсли;
    
КонецФункции
